/* ±Љд£Ї2021ƒк7‘¬18»’23:28

  є¶ƒ№£Ї
  
  ƒњµƒ£Ї мѕ§for—≠їЈ«ґћ„Ѕч≥ћ

  Єс љ£Їfor (A; B; C)
            for (D; E; F)
			     ......
	
*/
# include <stdio.h>

int main(void)
{
	int i;
	int j;

	for (i=0; i<3; i++)           
	{
		printf("иоиоио£°\n");
	    for (j=2; j<5; j++)
		{
			printf("єюєюєю£°\n");
		    printf("ќыќыќы!\n");
		}
        printf("ј≤ј≤ј≤!\n");
	}
	return 0;
}
/*
VC++6.0 д≥цљбєы£Ї
---------------------------------
иоиоио£°
єюєюєю£°
ќыќыќы!
єюєюєю£°
ќыќыќы!
єюєюєю£°
ќыќыќы!
ј≤ј≤ј≤!
иоиоио£°
єюєюєю£°
ќыќыќы!
єюєюєю£°
ќыќыќы!
єюєюєю£°
ќыќыќы!
ј≤ј≤ј≤!
иоиоио£°
єюєюєю£°
ќыќыќы!
єюєюєю£°
ќыќыќы!
єюєюєю£°
ќыќыќы!
ј≤ј≤ј≤!
---------------------------------
љб¬џ£Ї
*/