/*时间：2021年7月21日23:09

  功能：
  
  目的：
	
*/
# include <stdio.h>

int main()
{
	int a[3][4] = {
		{1,  2,  3,  4},
		{5,  6,  7,  8},
		{9, 10, 11, 12}
	};
/*
	int b[][4] = {                               //行可缺，列不可缺                
		{1, 2}, 
		{4, 5},                                  //不完全初始化，未赋值的补零
		{7, 8}
	};
*/
	int i;
	int j;
	
	for (i=0; i<3; ++i)                          //行和列的下标都从零开始
	{	
		for(j=0; j<4; ++j)
		{
			printf("%-5d  ", a[i][j]);           //-代表左对齐，5代表每个元素占五个光标的位置
//		    printf("%-5d  ", b[i][j]);
		}
		printf("\n");

	}
	
	return 0;
}
/*
VC++6.0输出结果：
---------------------------------

1      2      3      4
5      6      7      8
9      10     11     12

---------------------------------
结论：
*/
