/*
  时间：2021年10月08日22:09

  功能：
  
  目的：	
*/
# include <stdio.h>

int main(void)
{
	int i = 0;
	int count = 0;

	for (i=1; i<=100; i++)
	{
		if (9 == i % 10)            // if((9 == i %10) || (9 == i / 10))
		{
			count++;
			printf("%d ", i);
		}
		if (9 == i / 10)
		{
			count++;
			printf("%d ", i);
		}

//		if((9 == i %10) || (9 == i / 10))          //此时99只会被统计为一个9
	}

	printf("\ncount = %d\n", count);

	return 0;
}
/*
VC++6.0输出结果：
-----------------------------------------------------------

9 19 29 39 49 59 69 79 89 90 91 92 93 94 95 96 97 98 99 99
count = 20

----------------------------------------------------------
结论：
*/