/*时间：2021年7月18日21:18

  功能：
  
  目的：测试前自增与后自增的区别
	
*/
# include <stdio.h>

int main(void)
{
	int i;
	int b;
 //	int c;
 //	int d;
	int e;
	int f;
	
	i = b = 3;
//	d = ++b;                  //b+1 = 4 后再把4赋给d           ，前自增(先运算再赋值)
//	c = i++;                 // 先把i的值赋给c之后， i+1 = 4   ，后自增(先赋值在运算)
	
    e = --b;               //   b-1 = 2 后再把2赋给e           ，前自减(先运算再赋值)
	f = i--;              //    先把i的值赋给f之后， i-1 = 2   ，后自减(先赋值在运算)
	
//	printf("i = %d, b = %d, c = %d, d = %d\n", i, b, c, d,);
	printf("i = %d, b = %d, e = %d, f = %d\n", i, b, e, f);
	
	return 0;
}
/*
VC++6.0输出结果：
---------------------------------

自增：i = 4, b = 4, c = 3, d = 4
  
自减：i = 2, b = 2, e = 2, f = 3
	
---------------------------------
结论：前自增整体表达式的值是 b+1 之后的值
      后自增整体表达式的值是 i+1 之前的值
	  
	  前自减整体表达式的值是 b-1 之后的值
	  后自减整体表达式的值是 i+1 之前的值
*/